tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1459_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F1459_H_
#define _PIC16F1459_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define STATUS_C                      4
#define CARRY                         5
#define STATUS_DC                     6
#define ZERO                          7
#define STATUS_Z                      8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA3                           38
#define RA4                           39
#define RA5                           40
#define PORTB                         41
#define RB4                           42
#define RB5                           43
#define RB6                           44
#define RB7                           45
#define PORTC                         46
#define RC0                           47
#define RC1                           48
#define RC2                           49
#define RC3                           50
#define RC4                           51
#define RC5                           52
#define RC6                           53
#define RC7                           54
#define PIR1                          55
#define TMR1IF                        56
#define TMR2IF                        57
#define SSP1IF                        58
#define TXIF                          59
#define RCIF                          60
#define ADIF                          61
#define TMR1GIF                       62
#define PIR2                          63
#define ACTIF                         64
#define USBIF                         65
#define BCL1IF                        66
#define C1IF                          67
#define C2IF                          68
#define OSFIF                         69
#define TMR0                          70
#define TMR1L                         71
#define TMR1H                         72
#define T1CON                         73
#define TMR1ON                        74
#define nT1SYNC                       75
#define T1OSCEN                       76
#define T1CKPS0                       77
#define T1CKPS                        78
#define T1CKPS1                       79
#define TMR1CS0                       80
#define TMR1CS                        81
#define TMR1CS1                       82
#define T1GCON                        83
#define T1GSS0                        84
#define T1GSS                         85
#define T1GSS1                        86
#define T1GVAL                        87
#define T1GGO_nDONE                   88
#define T1GSPM                        89
#define T1GTM                         90
#define T1GPOL                        91
#define TMR1GE                        92
#define TMR2                          93
#define PR2                           94
#define T2CON                         95
#define T2CKPS0                       96
#define T2CKPS                        97
#define T2CKPS1                       98
#define TMR2ON                        99
#define T2OUTPS0                      100
#define T2OUTPS                       101
#define T2OUTPS1                      102
#define T2OUTPS2                      103
#define T2OUTPS3                      104
#define TRISA                         105
#define TRISA4                        106
#define TRISA5                        107
#define TRISB                         108
#define TRISB4                        109
#define TRISB5                        110
#define TRISB6                        111
#define TRISB7                        112
#define TRISC                         113
#define TRISC0                        114
#define TRISC1                        115
#define TRISC2                        116
#define TRISC3                        117
#define TRISC4                        118
#define TRISC5                        119
#define TRISC6                        120
#define TRISC7                        121
#define PIE1                          122
#define TMR1IE                        123
#define TMR2IE                        124
#define SSP1IE                        125
#define TXIE                          126
#define RCIE                          127
#define ADIE                          128
#define TMR1GIE                       129
#define PIE2                          130
#define ACTIE                         131
#define USBIE                         132
#define BCL1IE                        133
#define C1IE                          134
#define C2IE                          135
#define OSFIE                         136
#define OPTION_REG                    137
#define PS                            138
#define PS0                           139
#define PS1                           140
#define PS2                           141
#define PSA                           142
#define T0SE                          143
#define TMR0SE                        144
#define T0CS                          145
#define TMR0CS                        146
#define INTEDG                        147
#define nWPUEN                        148
#define PCON                          149
#define nBOR                          150
#define nPOR                          151
#define nRI                           152
#define nRMCLR                        153
#define nRWDT                         154
#define STKUNF                        155
#define STKOVF                        156
#define WDTCON                        157
#define SWDTEN                        158
#define WDTPS                         159
#define WDTPS0                        160
#define WDTPS1                        161
#define WDTPS2                        162
#define WDTPS3                        163
#define WDTPS4                        164
#define OSCTUNE                       165
#define TUN0                          166
#define TUN                           167
#define TUN1                          168
#define TUN2                          169
#define TUN3                          170
#define TUN4                          171
#define TUN5                          172
#define TUN6                          173
#define OSCCON                        174
#define SCS0                          175
#define SCS                           176
#define SCS1                          177
#define IRCF                          178
#define IRCF0                         179
#define IRCF1                         180
#define IRCF2                         181
#define IRCF3                         182
#define SPLLMULT                      183
#define SPLLEN                        184
#define OSCSTAT                       185
#define HFIOFS                        186
#define LFIOFR                        187
#define HFIOFR                        188
#define OSTS                          189
#define PLLRDY                        190
#define SOSCR                         191
#define ADRESL                        192
#define ADRESH                        193
#define ADCON0                        194
#define ADON                          195
#define GO_nDONE                      196
#define GO                            197
#define ADGO                          198
#define CHS0                          199
#define CHS                           200
#define CHS1                          201
#define CHS2                          202
#define CHS3                          203
#define CHS4                          204
#define ADCON1                        205
#define ADPREF0                       206
#define ADPREF                        207
#define ADPREF1                       208
#define ADCS0                         209
#define ADCS                          210
#define ADCS1                         211
#define ADCS2                         212
#define ADFM                          213
#define ADCON2                        214
#define TRIGSEL                       215
#define TRIGSEL0                      216
#define TRIGSEL1                      217
#define TRIGSEL2                      218
#define LATA                          219
#define LATA4                         220
#define LATA5                         221
#define LATB                          222
#define LATB4                         223
#define LATB5                         224
#define LATB6                         225
#define LATB7                         226
#define LATC                          227
#define LATC0                         228
#define LATC1                         229
#define LATC2                         230
#define LATC3                         231
#define LATC4                         232
#define LATC5                         233
#define LATC6                         234
#define LATC7                         235
#define CM1CON0                       236
#define C1SYNC                        237
#define C1HYS                         238
#define C1SP                          239
#define C1POL                         240
#define C1OE                          241
#define C1OUT                         242
#define C1ON                          243
#define CM1CON1                       244
#define C1NCH0                        245
#define C1NCH                         246
#define C1NCH1                        247
#define C1NCH2                        248
#define C1PCH                         249
#define C1PCH0                        250
#define C1PCH1                        251
#define C1INTN                        252
#define C1INTP                        253
#define CM2CON0                       254
#define C2SYNC                        255
#define C2HYS                         256
#define C2SP                          257
#define C2POL                         258
#define C2OE                          259
#define C2OUT                         260
#define C2ON                          261
#define CM2CON1                       262
#define C2NCH0                        263
#define C2NCH                         264
#define C2NCH1                        265
#define C2NCH2                        266
#define C2PCH                         267
#define C2PCH0                        268
#define C2PCH1                        269
#define C2INTN                        270
#define C2INTP                        271
#define CMOUT                         272
#define MC1OUT                        273
#define MC2OUT                        274
#define BORCON                        275
#define BORRDY                        276
#define BORFS                         277
#define SBOREN                        278
#define FVRCON                        279
#define ADFVR0                        280
#define ADFVR                         281
#define ADFVR1                        282
#define CDAFVR0                       283
#define CDAFVR                        284
#define CDAFVR1                       285
#define FVRRDY                        286
#define FVREN                         287
#define DACCON0                       288
#define D1PSS                         289
#define D1PSS0                        290
#define D1PSS1                        291
#define DACOE2                        292
#define DACOE1                        293
#define DACEN                         294
#define DACCON1                       295
#define DACR0                         296
#define DACR                          297
#define DACR1                         298
#define DACR2                         299
#define DACR3                         300
#define DACR4                         301
#define APFCON                        302
#define T1GSEL                        303
#define SSSEL                         304
#define CLKRSEL                       305
#define ANSELA                        306
#define ANSA4                         307
#define ANSELB                        308
#define ANSB4                         309
#define ANSB                          310
#define ANSB5                         311
#define ANSC0                         312
#define ANSELC                        313
#define ANSC1                         314
#define ANSC2                         315
#define ANSC3                         316
#define ANSC6                         317
#define ANSC7                         318
#define PMADRL                        319
#define PMADRH                        320
#define PMDATL                        321
#define PMDATH                        322
#define PMCON1                        323
#define RD                            324
#define WR                            325
#define WREN                          326
#define WRERR                         327
#define FREE                          328
#define LWLO                          329
#define CFGS                          330
#define PMCON2                        331
#define VREGCON                       332
#define VREGPM0                       333
#define VREGPM                        334
#define VREGPM1                       335
#define RCREG                         336
#define TXREG                         337
#define SPBRGL                        338
#define SPBRGH                        339
#define RCSTA                         340
#define RX9D                          341
#define OERR                          342
#define FERR                          343
#define ADDEN                         344
#define CREN                          345
#define SREN                          346
#define RX9                           347
#define SPEN                          348
#define TXSTA                         349
#define TX9D                          350
#define TRMT                          351
#define BRGH                          352
#define SENDB                         353
#define SYNC                          354
#define TXEN                          355
#define TX9                           356
#define CSRC                          357
#define BAUDCON                       358
#define ABDEN                         359
#define WUE                           360
#define BRG16                         361
#define SCKP                          362
#define RCIDL                         363
#define ABDOVF                        364
#define WPUA                          365
#define WPUA3                         366
#define WPUA4                         367
#define WPUA5                         368
#define WPUB                          369
#define WPUB4                         370
#define WPUB5                         371
#define WPUB6                         372
#define WPUB7                         373
#define SSP1BUF                       374
#define SSPBUF                        375
#define SSP1ADD                       376
#define SSPADD                        377
#define SSP1MSK                       378
#define SSPMSK                        379
#define SSP1STAT                      380
#define BF                            381
#define UA                            382
#define R_nW                          383
#define S                             384
#define P                             385
#define D_nA                          386
#define CKE                           387
#define SMP                           388
#define SSP1CON1                      389
#define SSP1M0                        390
#define SSPM                          391
#define SSP1M1                        392
#define SSP1M2                        393
#define SSP1M3                        394
#define CKP                           395
#define SSPEN                         396
#define SSP1EN                        397
#define SSP1OV                        398
#define SSPOV                         399
#define WCOL                          400
#define SSP1CON2                      401
#define SEN                           402
#define RSEN                          403
#define PEN                           404
#define RCEN                          405
#define ACKEN                         406
#define ACKDT                         407
#define ACKSTAT                       408
#define GCEN                          409
#define SSP1CON3                      410
#define DHEN                          411
#define AHEN                          412
#define SBCDE                         413
#define SDAHT                         414
#define BOEN                          415
#define SCIE                          416
#define PCIE                          417
#define ACKTIM                        418
#define IOCAP                         419
#define IOCAP0                        420
#define IOCAP1                        421
#define IOCAP3                        422
#define IOCAP4                        423
#define IOCAP5                        424
#define IOCAN0                        425
#define IOCAN                         426
#define IOCAN1                        427
#define IOCAN3                        428
#define IOCAN4                        429
#define IOCAN5                        430
#define IOCAF0                        431
#define IOCAF                         432
#define IOCAF1                        433
#define IOCAF3                        434
#define IOCAF4                        435
#define IOCAF5                        436
#define IOCBP                         437
#define IOCBP4                        438
#define IOCBP5                        439
#define IOCBP6                        440
#define IOCBP7                        441
#define IOCBN4                        442
#define IOCBN                         443
#define IOCBN5                        444
#define IOCBN6                        445
#define IOCBN7                        446
#define IOCBF4                        447
#define IOCBF                         448
#define IOCBF5                        449
#define IOCBF6                        450
#define IOCBF7                        451
#define CLKRCON                       452
#define CLKRDIV                       453
#define CLKRDIV0                      454
#define CLKRDIV1                      455
#define CLKRDIV2                      456
#define CLKRCD                        457
#define CLKRCD0                       458
#define CLKRCD1                       459
#define CLKRSLR                       460
#define CLKROE                        461
#define CLKREN                        462
#define ACTCON                        463
#define ACTORS                        464
#define ACTLOCK                       465
#define ACTSRC                        466
#define ACTUD                         467
#define ACTEN                         468
#define PWM1DCL                       469
#define PWM1DCL0                      470
#define PWM1DCL1                      471
#define PWM1DCH                       472
#define PWM1DCH0                      473
#define PWM1DCH1                      474
#define PWM1DCH2                      475
#define PWM1DCH3                      476
#define PWM1DCH4                      477
#define PWM1DCH5                      478
#define PWM1DCH6                      479
#define PWM1DCH7                      480
#define PWM1CON                       481
#define PWM1POL                       482
#define PWM1OUT                       483
#define PWM1OE                        484
#define PWM1EN                        485
#define PWM2DCL0                      486
#define PWM2DCL                       487
#define PWM2DCL1                      488
#define PWM2DCH0                      489
#define PWM2DCH                       490
#define PWM2DCH1                      491
#define PWM2DCH2                      492
#define PWM2DCH3                      493
#define PWM2DCH4                      494
#define PWM2DCH5                      495
#define PWM2DCH6                      496
#define PWM2DCH7                      497
#define PWM2CON                       498
#define PWM2POL                       499
#define PWM2OUT                       500
#define PWM2OE                        501
#define PWM2EN                        502
#define CWG1DBR0                      503
#define CWG1DBR                       504
#define CWG1DBR1                      505
#define CWG1DBR2                      506
#define CWG1DBR3                      507
#define CWG1DBR4                      508
#define CWG1DBR5                      509
#define CWG1DBF                       510
#define CWG1DBF0                      511
#define CWG1DBF1                      512
#define CWG1DBF2                      513
#define CWG1DBF3                      514
#define CWG1DBF4                      515
#define CWG1DBF5                      516
#define CWG1CON0                      517
#define G1CS0                         518
#define G1CS                          519
#define G1POLA                        520
#define G1POLB                        521
