tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1459_tdd.h
#define G1OEA                         522
#define G1OEB                         523
#define G1EN                          524
#define CWG1CON1                      525
#define G1IS0                         526
#define G1IS                          527
#define G1IS1                         528
#define G1ASDLA                       529
#define G1ASDLA0                      530
#define G1ASDLA1                      531
#define G1ASDLB                       532
#define G1ASDLB0                      533
#define G1ASDLB1                      534
#define CWG1CON2                      535
#define G1ASDSFLT                     536
#define G1ASDSC1                      537
#define G1ASDSC2                      538
#define G1ARSEN                       539
#define G1ASE                         540
#define UCON                          541
#define SUSPND                        542
#define RESUME                        543
#define USBEN                         544
#define PKTDIS                        545
#define SE0                           546
#define PPBRST                        547
#define USTAT                         548
#define PPBI                          549
#define DIR                           550
#define ENDP                          551
#define ENDP0                         552
#define ENDP1                         553
#define ENDP2                         554
#define ENDP3                         555
#define UIR                           556
#define URSTIF                        557
#define UERRIF                        558
#define ACTVIF                        559
#define TRNIF                         560
#define IDLEIF                        561
#define STALLIF                       562
#define SOFIF                         563
#define UCFG                          564
#define PPB                           565
#define PPB0                          566
#define PPB1                          567
#define FSEN                          568
#define UPUEN                         569
#define UTEYE                         570
#define UIE                           571
#define URSTIE                        572
#define UERRIE                        573
#define ACTVIE                        574
#define TRNIE                         575
#define IDLEIE                        576
#define STALLIE                       577
#define SOFIE                         578
#define UEIR                          579
#define PIDEF                         580
#define CRC5EF                        581
#define CRC16EF                       582
#define DFN8EF                        583
#define BTOEF                         584
#define BTSEF                         585
#define UFRMH                         586
#define FRM8                          587
#define FRM9                          588
#define FRM10                         589
#define UFRML                         590
#define FRM0                          591
#define FRM1                          592
#define FRM2                          593
#define FRM3                          594
#define FRM4                          595
#define FRM5                          596
#define FRM6                          597
#define FRM7                          598
#define UADDR                         599
#define ADDR0                         600
#define ADDR1                         601
#define ADDR2                         602
#define ADDR3                         603
#define ADDR4                         604
#define ADDR5                         605
#define ADDR6                         606
#define UEIE                          607
#define PIDEE                         608
#define CRC5EE                        609
#define CRC16EE                       610
#define DFN8EE                        611
#define BTOEE                         612
#define BTSEE                         613
#define UEP0                          614
#define UEP0_EPSTALL                  615
#define UEP0_EPINEN                   616
#define UEP0_EPOUTEN                  617
#define UEP0_EPCONDIS                 618
#define UEP0_EPHSHK                   619
#define UEP1                          620
#define UEP1_EPSTALL                  621
#define UEP1_EPINEN                   622
#define UEP1_EPOUTEN                  623
#define UEP1_EPCONDIS                 624
#define UEP1_EPHSHK                   625
#define UEP2                          626
#define UEP2_EPSTALL                  627
#define UEP2_EPINEN                   628
#define UEP2_EPOUTEN                  629
#define UEP2_EPCONDIS                 630
#define UEP2_EPHSHK                   631
#define UEP3                          632
#define UEP3_EPSTALL                  633
#define UEP3_EPINEN                   634
#define UEP3_EPOUTEN                  635
#define UEP3_EPCONDIS                 636
#define UEP3_EPHSHK                   637
#define UEP4                          638
#define UEP4_EPSTALL                  639
#define UEP4_EPINEN                   640
#define UEP4_EPOUTEN                  641
#define UEP4_EPCONDIS                 642
#define UEP4_EPHSHK                   643
#define UEP5                          644
#define UEP5_EPSTALL                  645
#define UEP5_EPINEN                   646
#define UEP5_EPOUTEN                  647
#define UEP5_EPCONDIS                 648
#define UEP5_EPHSHK                   649
#define UEP6                          650
#define UEP6_EPSTALL                  651
#define UEP6_EPINEN                   652
#define UEP6_EPOUTEN                  653
#define UEP6_EPCONDIS                 654
#define UEP6_EPHSHK                   655
#define UEP7                          656
#define UEP7_EPSTALL                  657
#define UEP7_EPINEN                   658
#define UEP7_EPOUTEN                  659
#define UEP7_EPCONDIS                 660
#define UEP7_EPHSHK                   661
#define STATUS_SHAD                   662
#define STATUS_SHAD_C                 663
#define STATUS_SHAD_DC                664
#define STATUS_SHAD_Z                 665
#define WREG_SHAD                     666
#define BSR_SHAD                      667
#define PCLATH_SHAD                   668
#define FSR0L_SHAD                    669
#define FSR0H_SHAD                    670
#define FSR1L_SHAD                    671
#define FSR1H_SHAD                    672
#define STKPTR                        673
#define TOSL                          674
#define TOSH                          675

#endif // _PIC16F1459_H_
